notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>notes</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-03-22 17:55:12 UTC"/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">notes</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Java-Heroku </a>
<ul>
<li><a href="#sec-1.1">1.1 Goals </a></li>
<li><a href="#sec-1.2">1.2 In Progress </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Java-Heroku </h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> Goals </h3>
<div class="outline-text-3" id="text-1.1">

<ul>
<li>
simple playground for learning java webapps
</li>
<li>
keep it simple, no frameworks, raw java
</li>
<li>
learn about importing libraries using Maven
</li>
<li>
avoid IDEs for now, just using Emacs over SSH

</li>
</ul>
</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> In Progress </h3>
<div class="outline-text-3" id="text-1.2">

<ul>
<li>
connect to database, run a query, return formatted results
</li>
<li>
JSON output
</li>
<li>
A simple backend like my `games` PHP app
</li>
<li>
How do I handle connections?
</li>
<li>
I need to add a DB to my heroku account or I cant deploy it again
</li>
<li>
determine if it is running on heroku &amp; not connect to database?
</li>
</ul>
</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: 
<a href="mailto:nick@dualscar.com">&lt;nick@dualscar.com&gt;</a>
</p>
<p class="date"> Date: 2014-03-22 17:55:12 UTC</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
